<?php
    // Задача: создадим массив с годами от 1998 по 2023 и заполним массив с помощью for

    $start = 1998;
    $finish = 2023;
    $arr = [];

   for ($i = $start; $i <= $finish; $i++){
       $arr[] = $i;
   }

   print_r($arr);
   // с помощью цикла foreach необходимо вывести года

    foreach ($arr as $item) {
        echo $item . '<br>';
    };

    /*
        1998
        1999
        2000
        2001
        2002
        2003
        2004
        2005
        2006
        2007
        2008
        2009
        2010
        2011
        2012
        2013
        2014
        2015
        2016
        2017
        2018
        2019
        2020
        2021
        2022
        2023
     */