<?php
    // echo - вывод
    function sum_2_args($num1, $num2) {
        $res = $num1 + $num2;

        echo $res; // выводим значениие
    }

    // тестируем функцию
    // sum_2_args(2,3); // 5

    //_______________________________________________________
    // return - возврат значения
    function sum_2_agrs_cust($num, $num2){
        $res = $num + $num2;

        return $res; // возвращаем значение
    }

    // тестирование функции
    $res = sum_2_agrs_cust(4,3); // 7
    //echo $res;

    //_______________________________________________________
    //_______________________________________________________
    //_______________________________________________________

    /*
        создадим массив с годами от 1998 по текущий год.
        заполним массив с помощью цикла for
     */

    $start = 1998;
    $finish = 2023;
    $arr = [];

    for ($i = $start; $i <= 2023; $i++){
        $arr[] = $i;
    }

    //print_r($arr);

    //_______________________________________________________
    //_______________________________________________________
    //_______________________________________________________
    /*
       создадим массив с годами от 1998 по текущий год.
       заполним массив с помощью цикла for
       необходимо реализоват функцию
    */

    function years($start, $finish){
        $arr = [];

        if ($start < $finish){
            for ($i = $start; $i <= $finish; $i++){
                $arr[] = $i;
            }

            return $arr;
        } else {
            $res = "Начало диапазона должно быть больше конца диапазона";

            return $res;
        }
    }

    /*
      с помощью нашей функции заполним массив годами от 2000 до 2100
     */

    //$res1 = years(2000,2100);
    // print_r($res1);

    /*
        foreach ($res1 as $item){
            echo "$item год;   ";
        }
    */

    function show_items($arr){
        foreach ($arr as $item){
            echo "$item год;  ";
        }
    }

    $res2 = years(1998, 2023);

    show_items($res2);