<?php
// напишем шаблон поиска домена

$pattern = '#([\w-]+)\.([a-z]{2,})#';
$subject = 'site.ru site.com site.exe';
/*
 шаблон поиска домен - $pattern = '#(\w-)\.([a-z]{2,})#'
 пример - site.ru

 1 - й карман - ([\w-]+) доменное имя
 пример - site

 2 - й карман - ([a-z]{2,}) доменая зона
 пример - ru
 */

$res = preg_match_all($pattern, $subject, $matches);

/*
 массив $matches в функции preg_match_all содержит

 0 - й элемент - массив совпадений с регулярным выражением (домены)
 '#(\w-)\.([a-z]{2,})#'

 1 - й элемент - массив совпадений с 1-м карманом регулярного выражения
 доменые имена - ([\w-]+)

 2 - й элемент - массив совпадений с 2-м карманом регулярного выражения
 доменые зоны - ([a-z]{2,})

 */

// print_r($matches);

// Array ( [0] => Array ( [0] => site.ru [1] => site.com [2] => site.exe ) [1] => Array ( [0] => site [1] => site [2] => site ) [2] => Array ( [0] => ru [1] => com [2] => exe ) )

/*
  0 => [0 => site.ru, 1 => site.com, 2 => site.exe], // домены
  1 => [0 => site, 1 => site, 2 => site], // доменые имена
  2 => [0 => ru, 1 => com, 2 => exe] // доменные зоны
 */